# 모스부호 (1)
# 프로그래머스 L0 (기초·입문)
# 문제 링크: https://school.programmers.co.kr/learn/courses/30/lessons/120838
# 알고리즘: 기초
# 작성자: 백하은
# 작성일: 2026. 02. 25. 12:30:48

def solution(letter):
    # 모스부호 해석표
    morse = { 
    '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
    '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
    '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
    '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
    '-.--':'y','--..':'z'
}
    # 입력된 데이터를 공백을 기준으로 분리 (공백을 기준으로 모스부로가 나열된 형태로 입력되니까)
    words = letter.split(' ')
    
    # 모스부호 해석
    answer = ''
    
    for m in words:
        answer += morse[m]
        
    return answer    